Revit 2026 API

# FieldValues(IListVectorAtPoint) Constructor

---

Initializes a new instance of the FieldValues class

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FieldValues(
	IList<VectorAtPoint> vectorAtPoint
)
```
```vb
Public Sub New (
	vectorAtPoint As IList(Of VectorAtPoint)
)
```
```cpp
public:
FieldValues(
	IList<VectorAtPoint^>^ vectorAtPoint
)
```
```fsharp
new :
        vectorAtPoint : IList<VectorAtPoint> -> FieldValues
```

#### Parameters

vectorAtPoint IListVectorAtPoint

#### Reference

FieldValues Class

FieldValues Overload

Autodesk.Revit.DB.Analysis Namespace